CREATE TABLE sales_2 (
    id SERIAL PRIMARY KEY,
    seller TEXT,
    sale_date DATE,
    amount NUMERIC,
    product_category TEXT
);

INSERT INTO sales_2 (seller, sale_date, amount, product_category) VALUES
('Дмитрий', '2024-01-01', 100, 'Электроника'),
('Дмитрий', '2024-01-05', 200, 'Одежда'),
('Дмитрий', '2024-01-10', 300, 'Электроника'),
('Катерина', '2024-01-02', 400, 'Книги'),
('Катерина', '2024-01-07', 100, 'Одежда'),
('Катерина', '2024-01-08', 600, 'Электроника'),
('Олег', '2024-01-03', 300, 'Книги'),
('Олег', '2024-01-10', 300, 'Книги'),
('Олег', '2024-01-12', 300, 'Одежда');